# ENDTERM EXAMINATION: <br> Olympic Games Data Analysis (1896-2016): Trends in Athlete Demographics, Performance, and Participation <hr style = "border: 2.5px solid #ff33a5"></hr>

Name: **Pia Mae D. Tolentino** <br>
Course and Section: **BSCpE-2A**

In [66]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Overview of the Dataset

In [67]:
df = pd.read_csv(r"C:\Users\63905\OneDrive\Desktop\MATHEDA-V-TOLENTINO\MATHEDA-V-TOLENTINO\ENDTERM EXAMINATION\Raw\athletes_events.csv", 
                 delimiter=",")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8048 entries, 0 to 8047
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      8048 non-null   int64
 1   Name    8048 non-null   object
 2   Sex     8048 non-null   object
 3   Age     7781 non-null   float64
 4   Height  6273 non-null   float64
 5   Weight  6184 non-null   float64
 6   Team    8048 non-null   object
 7   NOC     8048 non-null   object
 8   Games   8048 non-null   object
 9   Year    8048 non-null   int64
 10  Season  8048 non-null   object
 11  City    8048 non-null   object
 12  Sport   8048 non-null   object
 13  Event   8048 non-null   object
 14  Medal   8048 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 943.3+ KB

In [68]:
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,41410,Ahmed Goneim,M,NaN,NaN,NaN,United Arab Republic,UAR,1960 Summer,1960,Summer,Roma,Gymnastics,Gymnastics Men's Floor Exercise,No Medal
1,62946,Tadahiro Kosaka,M,28.0,179.0,65.0,Japan,JPN,1988 Summer,1988,Summer,Seoul,Athletics,Athletics Men's 50 kilometres Walk,No Medal
2,16075,Marano Bucio Ramrez,M,33.0,168.0,72.0,Mexico,MEX,1976 Summer,1976,Summer,Montreal,Equestrianism,"Equestrianism Mixed Three-Day Event, Individual",No Medal
3,124796,Hubert Van Nerom,M,28.0,NaN,NaN,Belgium,BEL,1936 Summer,1936,Summer,Berlin,Fencing,"Fencing Men's Sabre, Team",No Medal
4,856,Per Owe Adamson,M,25.0,171.0,65.0,Sweden,SWE,1960 Summer,1960,Summer,Roma,Cycling,"Cycling Men's Road Race, Individual",No Medal

In [69]:
df = df.drop(df.columns[0], axis=1)
df.head()

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,Ahmed Goneim,M,NaN,NaN,NaN,United Arab Republic,UAR,1960 Summer,1960,Summer,Roma,Gymnastics,Gymnastics Men's Floor Exercise,No Medal
1,Tadahiro Kosaka,M,28.0,179.0,65.0,Japan,JPN,1988 Summer,1988,Summer,Seoul,Athletics,Athletics Men's 50 kilometres Walk,No Medal
2,Marano Bucio Ramrez,M,33.0,168.0,72.0,Mexico,MEX,1976 Summer,1976,Summer,Montreal,Equestrianism,"Equestrianism Mixed Three-Day Event, Individual",No Medal
3,Hubert Van Nerom,M,28.0,NaN,NaN,Belgium,BEL,1936 Summer,1936,Summer,Berlin,Fencing,"Fencing Men's Sabre, Team",No Medal
4,Per Owe Adamson,M,25.0,171.0,65.0,Sweden,SWE,1960 Summer,1960,Summer,Roma,Cycling,"Cycling Men's Road Race, Individual",No Medal

In [105]:
df_o = df.rename(columns = {
    'ID' : 'Athlete_ID' ,
    'Name' : 'Athlete_Name' ,
    'Sex' : 'Athlete_Sex' ,
    'Age' : 'Athlete_Age' ,
    'Height' : 'Athlete_Height (cm)' ,
    'Weight' : 'Athlete_Weight (Kg)' ,
    
})
df_o.info()
df_l = df_o.copy()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8048 entries, 0 to 8047
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Athlete_Name         8048 non-null   object
 1   Athlete_Sex          8048 non-null   object
 2   Athlete_Age          7781 non-null   float64
 3   Athlete_Height (cm)  6273 non-null   float64
 4   Athlete_Weight (Kg)  6184 non-null   float64
 5   Team                 8048 non-null   object
 6   NOC                  8048 non-null   object
 7   Games                8048 non-null   object
 8   Year                 8048 non-null   int64
 9   Season               8048 non-null   object
 10  City                 8048 non-null   object
 11  Sport                8048 non-null   object
 12  Event                8048 non-null   object
 13  Medal                8048 non-null   object
dtypes: float64(3), int64(1), object(10)
memory usage: 880.4+ KB

## Determine **distinct** values.

In [71]:
df_o['Athlete_Sex'].unique()

array(['M', 'F'], dtype=object)

In [72]:
df_o['Athlete_Sex'].nunique()

2

In [73]:
df_o['Athlete_Age'].unique()

array([nan, 28., 33., 25., 18., 23., 22., 32., 21., 53., 20., 43., 27.,
       29., 24., 31., 19., 36., 26., 34., 16., 42., 30., 74., 17., 41.,
       15., 35., 65., 71., 40., 45., 44., 39., 38., 48., 47., 73., 37.,
       61., 56., 14., 13., 46., 57., 49., 52., 50., 55., 63., 64., 51.,
       67., 60., 12., 59., 58., 75., 72., 70.])

In [74]:
df_o['Athlete_Age'].nunique()

59

In [75]:
df_o['Athlete_Height (cm)'].unique()

array([ nan, 179., 168., 171., 184., 175., 178., 180., 182., 161., 155.,
       162., 190., 186., 170., 173., 169., 154., 172., 203., 185., 166.,
       191., 183., 160., 174., 198., 187., 163., 167., 148., 192., 164.,
       158., 156., 197., 188., 181., 177., 176., 159., 165., 189., 157.,
       193., 196., 153., 150., 194., 213., 195., 208., 147., 151., 200.,
       146., 216., 204., 202., 217., 144., 206., 152., 205., 201., 149.,
       211., 199., 142., 136., 145., 207., 138., 210., 141.])

In [76]:
df_o['Athlete_Height (cm)'].nunique()

74

In [77]:
df_o['Athlete_Weight (Kg)'].unique()

array([         nan,  65.        ,  72.        ,  74.        ,
        83.        ,  80.        ,  70.        ,  68.        ,
        77.        ,  88.        ,  69.        ,  58.        ,
        64.        ,  53.        ,  57.        ,  56.        ,
        59.        ,  90.        , 103.        ,  60.        ,
        78.        ,  63.        ,  52.        ,  66.        ,
       120.        ,  54.        ,  62.        ,  92.        ,
       100.        ,  75.        ,  84.        ,  55.        ,
        81.        ,  38.        ,  74.5       ,  67.        ,
        82.        ,  71.        , 109.        ,  76.        ,
        87.        ,  50.        ,  91.        ,  89.        ,
        85.        ,  79.        , 155.        ,  51.        ,
        86.        ,  73.        ,  93.        , 115.        ,
        95.        ,  94.        ,  46.        ,  47.        ,
        40.        ,  96.        ,  61.        ,  48.        ,
       102.        ,  97.        ,  39.        ,  49.        ,
       113.        ,  76.5       ,  98.        ,  43.        ,
       130.        , 107.        , 112.        ,  42.        ,
       110.        ,  54.5       ,  69.5       , 122.        ,
        99.        , 144.        ,  41.        ,  45.        ,
       105.        , 129.        ,  55.5       ,  44.        ,
       104.        ,  32.        ,  37.        ,  35.        ,
        81.5       , 111.        ,  92.5       , 128.        ,
        65.5       ,  34.        , 145.        , 150.        ,
       127.        , 131.        , 143.        , 106.        ,
       125.        , 108.        , 114.        , 139.        ,
       141.        , 117.        , 118.        ,  59.5       ,
       170.        , 106.5       ,  73.5       ,  86.5       ,
        87.5       , 119.        , 137.5       , 101.        ,
        60.5       , 116.        ,  30.        ,  66.5       ,
        78.5       ,  33.        ,  67.5       , 137.        ,
        52.5       , 140.        ,  68.5       ,  90.5       ,
        85.5       , 126.        ,  77.33333333,  70.5       ,
        63.5       ,  96.5       ,  28.        ,  83.5       ,
       135.        ])

In [78]:
df_o['Athlete_Weight (Kg)'].nunique()

136

In [79]:
df_o['Team'].unique()

array(['United Arab Republic', 'Japan', 'Mexico', 'Belgium', 'Sweden',
       'Denmark', 'Italy', 'Georgia', 'Luxembourg', 'Spain',
       'United States', 'Puerto Rico', 'Austria', 'Liechtenstein',
       'Germany', 'Great Britain', 'Czechoslovakia', 'Greece',
       'South Korea', 'France-3', 'Romania', 'China', 'Netherlands',
       'Croatia', 'Venezuela', 'Canada', 'Australia', 'Iran', 'France',
       'Chinese Taipei', 'Ukraine', 'Serbia and Montenegro',
       'West Germany', 'Soviet Union', 'Mali', 'Antares', 'Poland',
       'Trinidad and Tobago', 'Latvia', 'France-2', 'Bulgaria',
       'Pakistan', 'Australia-1', 'Finland', 'Sierra Leone', 'Kyrgyzstan',
       'Cuba', 'Ecuador', 'Yugoslavia', 'Algeria', 'Iceland', 'Hong Kong',
       'New Zealand', 'Hungary', 'Turkey', 'Czech Republic', 'Kazakhstan',
       'Panama', 'Ylliam II', 'Ireland', 'Zimbabwe', 'Switzerland',
       'Unified Team', 'Chile', 'Jamaica', 'Kenya', 'Egypt', 'Russia',
       'Qatar', 'South Africa', 'Seychelles', 'Bahrain', 'Ghana',
       'Guatemala', 'Belarus', 'Slovenia', 'Japan-2', 'Lebanon', 'India',
       'Argentina', 'Somalia', '30. Februar', 'Peru', 'Norway',
       'Colombia', 'China-2', 'Uzbekistan', 'East Germany', 'Canada-2',
       'Iraq', 'Angola', 'Cameroon', 'Brazil', 'Minerva Amsterdam',
       'Congo (Kinshasa)', 'Ethiopia', 'Canada-1', 'Cyprus', 'Baby-1',
       'Saar', 'Singapore', 'United States Virgin Islands-2',
       'Montenegro', 'Afghanistan', 'Bosnia and Herzegovina', 'Sri Lanka',
       'Bohemia', 'Thailand', 'Ukraine-2', 'United States-2', 'Malaysia',
       'Portugal', 'Uruguay', 'Samoa', 'Nigeria', 'Indonesia',
       'Austria-1', 'Morocco', 'Serbia', 'Slovakia', 'North Korea',
       'Marinai della nave da guerra "Varese"',
       'Royal Club Nautique de Gand', 'Moldova', 'Costa Rica',
       "Cote d'Ivoire", 'Myanmar', 'Guinea Bissau', 'Belize',
       'Azerbaijan', 'Haiti', 'Benin', 'Lithuania',
       'Pan-Hellenic Athletic Club', 'Sweden-2', 'Gabon',
       'Helsingfors R. K.', 'United States-3', 'France-1', 'Guam',
       'Armenia', 'Tunisia', 'Gambia', 'Saudi Arabia', 'Russia-1',
       'Kuwait', 'Cook Islands', 'Honduras', 'Estonia', 'Belgium-1',
       'Nicaragua', 'Esterel-1', 'Pierre et Jean-4', 'Philippines',
       'Individual Olympic Athletes', 'Bermuda', 'Fiji',
       'Papua New Guinea', 'United States-1', 'Sudan', 'Lucky Star',
       'Mauritius', 'Italy-2', 'Guyana', 'Germany-2', 'Mongolia',
       'Vision', 'British Virgin Islands', 'Czech Republic-1', 'Tip',
       'Silja', 'May Be VII', 'Israel', 'Central Turnverein, Chicago',
       'Australasia', 'Oleander II', 'Libya', 'Hojwa', 'Uganda',
       'Burundi', 'West Germany-2', 'Sildra-1', 'New College, Oxford-2',
       'Soviet Union-3', 'Nautikos Omilos-3', 'Rwanda', 'Monaco',
       'Greece-2', 'Danaldo', 'Antigua and Barbuda', 'Bronia',
       'Turnverein Vorwrts, Cleveland', 'Solomon Islands', 'Latvia-1',
       'Turkmenistan', 'Senegal', 'Toronto Argonauts', 'Scotia',
       'Martha-1', 'Great Britain-1', 'Albania', 'Tanzania', 'China-3',
       'China-1', 'India-1', 'Acipactli', 'Polyteknisk Roklub-1',
       "Qu'Importe", 'Syria', 'Indonesia-2', 'Siames-Cat',
       'Racing Club de France', 'Crabe II-4', 'Andorra',
       'South St Louis Turnverein, St Louis', 'San Marino', 'Russia-2',
       'American Samoa', 'Barbados', 'East Germany-2',
       'Dominican Republic', 'United Arab Emirates', 'Romania-2',
       'Gitana-21', 'Nigeria-2', 'Cayman Islands', 'Vinga-1',
       'Yugoslavia-2', 'Germany-1', 'Rhodesia', 'Italy-1', 'Blue Red',
       'Czechoslovakia-1', 'Spain-1', 'Bolivia', 'Liberia',
       'Switzerland-2', 'Central African Republic', 'Slaghoken',
       'Mystery', 'Buraddoo', 'Edelweiss II-1', 'Anitra', 'rn-2',
       'Ceres II', 'Zambia', 'Poland-2', 'Great Britain-2',
       'Burkina Faso', 'Orion', 'South Africa-2', 'Tonga', 'Japan-1',
       'Mebi', 'Namibia', 'Botswana', 'Bahamas', 'South Korea-2',
       'Pan II', 'Paraguay', 'West Indies Federation', 'Crabe I-11',
       'Teresita', 'Leander Club-1', 'Hong Kong-1', 'Calcinhas',
       'Belgium-4', 'Soviet Union-2', 'Niger', 'Ylliam VII', 'Athens-2',
       'Lesotho', 'Arcturus', 'West Germany-1', 'Chuckles',
       'Germania Ruder Club, Hamburg', 'Swaziland', 'Oman', 'Eritrea',
       'Mozambique', 'Malawi', 'Moseley Wanderers',
       'Large boat, Central Naval Prep School "Poros"-1',
       'Greenoaks Dundee', 'Spirit III', 'Guinea', 'Jordan', 'Romania-1',
       'Togo', 'Palestine', 'Tritons Lillois-2',
       'Liverpool Police Team-2', 'Tajikistan', 'Allegro',
       'Soviet Union-1', 'Belgium-2', 'Austria-2', 'Yangon', 'Llanoria',
       'Sweden-1', 'Peiraikos Syndesmos-2', 'Grenada', 'Mignon-3',
       'Unified Team-1', 'South Vietnam',
       'Union des Socits Franais de Sports Athletiques', 'Nephos I',
       'Kurush IV', 'Pannonia RC/National RC', 'Italia', 'East Germany-1',
       'Century Boat Club-1', 'Malta', 'Chamukina', 'Laos',
       'Galt Football Club', 'Switzerland-1', 'Ireland-2', 'Frieda',
       'Cincinnati Archers', 'United States Virgin Islands', 'Norway-3',
       'Angelita', 'Socialer Turnverein, Detroit', 'Argentina-1',
       'Freddy', 'Tournade-40', 'Bangladesh', 'Donar III', 'Australia-2',
       'Yeoman VII', 'El Salvador', 'Ravenswood Boat Club-2',
       'Marmi II-1', 'Madagascar', 'Balaton', 'Djinn', 'Satchmo',
       'Saint Vincent and the Grenadines', 'Western Rowing Club-3',
       'South Korea-1', 'Cambria', 'Hungaria Evezos Egylet', 'Sheerio',
       'Maldives', 'Upton Park FC', 'Mauritania', 'Hatuey', 'Djibouti',
       'Pam', 'Calimucho', 'Malaya', 'Gwendoline-2', 'Vinha', 'Nepal',
       'Belgium-3'], dtype=object)

In [80]:
df_o['Team'].nunique()

356

In [81]:
df_o['Games'].unique()

array(['1960 Summer', '1988 Summer', '1976 Summer', '1936 Summer',
       '2012 Summer', '1964 Summer', '2014 Winter', '1952 Summer',
       '1932 Summer', '1920 Summer', '1968 Summer', '1994 Winter',
       '1992 Summer', '1972 Summer', '1896 Summer', '2000 Summer',
       '1924 Summer', '2016 Summer', '1972 Winter', '2006 Winter',
       '1964 Winter', '2010 Winter', '1998 Winter', '1928 Summer',
       '1904 Summer', '2002 Winter', '2004 Summer', '1996 Summer',
       '1984 Summer', '1948 Summer', '1980 Summer', '1956 Summer',
       '2008 Summer', '1936 Winter', '1912 Summer', '1984 Winter',
       '1906 Summer', '1908 Summer', '1988 Winter', '1928 Winter',
       '1968 Winter', '1992 Winter', '1948 Winter', '1960 Winter',
       '1956 Winter', '1900 Summer', '1952 Winter', '1924 Winter',
       '1980 Winter', '1976 Winter', '1932 Winter'], dtype=object)

In [82]:
df_o['Games'].nunique()

51

In [83]:
df_o['Sport'].unique()

array(['Gymnastics', 'Athletics', 'Equestrianism', 'Fencing', 'Cycling',
       'Sailing', 'Rowing', 'Alpine Skiing', 'Art Competitions',
       'Tug-Of-War', 'Swimming', 'Ice Hockey', 'Shooting', 'Diving',
       'Tennis', 'Cross Country Skiing', 'Luge', 'Volleyball',
       'Wrestling', 'Snowboarding', 'Archery',
       'Short Track Speed Skating', 'Speed Skating', 'Nordic Combined',
       'Basketball', 'Curling', 'Baseball', 'Boxing', 'Biathlon',
       'Figure Skating', 'Beach Volleyball', 'Football', 'Hockey',
       'Table Tennis', 'Weightlifting', 'Water Polo', 'Judo', 'Handball',
       'Badminton', 'Canoeing', 'Trampolining', 'Bobsleigh',
       'Freestyle Skiing', 'Modern Pentathlon', 'Synchronized Swimming',
       'Softball', 'Ski Jumping', 'Croquet', 'Taekwondo', 'Skeleton',
       'Military Ski Patrol', 'Rhythmic Gymnastics', 'Triathlon',
       'Rugby Sevens', 'Golf', 'Lacrosse', 'Rugby', 'Cricket'],
      dtype=object)

In [84]:
df_o['Sport'].nunique()

58

In [85]:
df_o['Medal'].unique()

array(['No Medal', 'Silver', 'Bronze', 'Gold'], dtype=object)

In [86]:
df_o['Medal'].nunique()

4

## Data Cleaning - Dropping NaN

In [87]:
df_o.isna().sum()

Athlete_Name              0
Athlete_Sex               0
Athlete_Age             267
Athlete_Height (cm)    1775
Athlete_Weight (Kg)    1864
Team                      0
NOC                       0
Games                     0
Year                      0
Season                    0
City                      0
Sport                     0
Event                     0
Medal                     0
dtype: int64

In [88]:
# Cleaning Athlete_Age

df_o = df_o.dropna(subset=['Athlete_Age'])
df_o.isna().sum()

Athlete_Name              0
Athlete_Sex               0
Athlete_Age               0
Athlete_Height (cm)    1535
Athlete_Weight (Kg)    1617
Team                      0
NOC                       0
Games                     0
Year                      0
Season                    0
City                      0
Sport                     0
Event                     0
Medal                     0
dtype: int64

In [89]:
# Cleaning Athlete_Height

df_o = df_o.dropna(subset=['Athlete_Height (cm)'])
df_o.isna().sum()

Athlete_Name             0
Athlete_Sex              0
Athlete_Age              0
Athlete_Height (cm)      0
Athlete_Weight (Kg)    124
Team                     0
NOC                      0
Games                    0
Year                     0
Season                   0
City                     0
Sport                    0
Event                    0
Medal                    0
dtype: int64

In [90]:
# Cleaning Athlete_Weight

df_o = df_o.dropna(subset=['Athlete_Weight (Kg)'])
df_o.isna().sum()

Athlete_Name           0
Athlete_Sex            0
Athlete_Age            0
Athlete_Height (cm)    0
Athlete_Weight (Kg)    0
Team                   0
NOC                    0
Games                  0
Year                   0
Season                 0
City                   0
Sport                  0
Event                  0
Medal                  0
dtype: int64

In [91]:
df_o = df_o.dropna(subset=['Athlete_Age','Athlete_Height (cm)','Athlete_Weight (Kg)'])
df_o.isna().sum()

Athlete_Name           0
Athlete_Sex            0
Athlete_Age            0
Athlete_Height (cm)    0
Athlete_Weight (Kg)    0
Team                   0
NOC                    0
Games                  0
Year                   0
Season                 0
City                   0
Sport                  0
Event                  0
Medal                  0
dtype: int64

In [106]:
df_l = df_o.copy()
df_l.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8048 entries, 0 to 8047
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Athlete_Name         8048 non-null   object
 1   Athlete_Sex          8048 non-null   object
 2   Athlete_Age          7781 non-null   float64
 3   Athlete_Height (cm)  6273 non-null   float64
 4   Athlete_Weight (Kg)  6184 non-null   float64
 5   Team                 8048 non-null   object
 6   NOC                  8048 non-null   object
 7   Games                8048 non-null   object
 8   Year                 8048 non-null   int64
 9   Season               8048 non-null   object
 10  City                 8048 non-null   object
 11  Sport                8048 non-null   object
 12  Event                8048 non-null   object
 13  Medal                8048 non-null   object
dtypes: float64(3), int64(1), object(10)
memory usage: 880.4+ KB

In [110]:
# Cleaning Athlete_Age with Mean

Aage_mean = df_o['Athlete_Age'].mean()
print(Aage_mean)
df_l['Athlete_Age'] = df_l['Athlete_Age'].fillna(Aage_mean)

25.51561495951677

In [111]:
# Cleaning Athlete_Height with Mean

Aheight_mean = df_o['Athlete_Height (cm)'].mean()
print(Aheight_mean)
df_l['Athlete_Height'] = df_l['Athlete_Height (cm)'].fillna(Aheight_mean)

175.31898613103778

In [112]:
# Cleaning Athlete_Weight with Mean

Aweight_mean = df_o['Athlete_Weight (Kg)'].mean()
print(Aweight_mean)
df_l['Athlete_Weight'] = df_l['Athlete_Weight (Kg)'].fillna(Aweight_mean)

70.67057460112117

In [107]:
df_l.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8048 entries, 0 to 8047
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Athlete_Name         8048 non-null   object
 1   Athlete_Sex          8048 non-null   object
 2   Athlete_Age          7781 non-null   float64
 3   Athlete_Height (cm)  6273 non-null   float64
 4   Athlete_Weight (Kg)  6184 non-null   float64
 5   Team                 8048 non-null   object
 6   NOC                  8048 non-null   object
 7   Games                8048 non-null   object
 8   Year                 8048 non-null   int64
 9   Season               8048 non-null   object
 10  City                 8048 non-null   object
 11  Sport                8048 non-null   object
 12  Event                8048 non-null   object
 13  Medal                8048 non-null   object
dtypes: float64(3), int64(1), object(10)
memory usage: 880.4+ KB

In [113]:
df_l.describe()

,Athlete_Age,Athlete_Height (cm),Athlete_Weight (Kg),Year,Athlete_Height,Athlete_Weight
count,8048.000000,6273.000000,6184.000000,8048.000000,8048.000000,8048.000000
mean,25.515615,175.318986,70.670575,1978.129225,175.318986,70.670575
std,6.103752,10.418619,14.330282,29.946760,9.198059,12.561380
min,12.000000,136.000000,28.000000,1896.000000,136.000000,28.000000
25%,22.000000,168.000000,60.000000,1960.000000,170.000000,63.000000
50%,25.000000,175.000000,70.000000,1988.000000,175.318986,70.670575
75%,28.000000,182.000000,80.000000,2002.000000,180.000000,76.000000
max,75.000000,217.000000,170.000000,2016.000000,217.000000,170.000000

In [99]:
print(df_o.isnull().sum())

Athlete_Name           0
Athlete_Sex            0
Athlete_Age            0
Athlete_Height (cm)    0
Athlete_Weight (Kg)    0
Team                   0
NOC                    0
Games                  0
Year                   0
Season                 0
City                   0
Sport                  0
Event                  0
Medal                  0
dtype: int64

In [108]:
print(df_o.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8048 entries, 0 to 8047
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Athlete_Name         8048 non-null   object
 1   Athlete_Sex          8048 non-null   object
 2   Athlete_Age          7781 non-null   float64
 3   Athlete_Height (cm)  6273 non-null   float64
 4   Athlete_Weight (Kg)  6184 non-null   float64
 5   Team                 8048 non-null   object
 6   NOC                  8048 non-null   object
 7   Games                8048 non-null   object
 8   Year                 8048 non-null   int64
 9   Season               8048 non-null   object
 10  City                 8048 non-null   object
 11  Sport                8048 non-null   object
 12  Event                8048 non-null   object
 13  Medal                8048 non-null   object
dtypes: float64(3), int64(1), object(10)
memory usage: 880.4+ KB
None

## Lambda Function

In [101]:
df_l.isna().sum()

Athlete_Name           0
Athlete_Sex            0
Athlete_Age            0
Athlete_Height (cm)    0
Athlete_Weight (Kg)    0
Team                   0
NOC                    0
Games                  0
Year                   0
Season                 0
City                   0
Sport                  0
Event                  0
Medal                  0
Athlete_Height         0
Athlete_Weight         0
dtype: int64

In [102]:
n_columns = ['Athlete_Age',
             'Athlete_Height (cm)',
             'Athlete_Weight (Kg)',]
df_l[n_columns] = df_l[n_columns].apply(lambda n : n.fillna(n.mean()))
df_l.isna().sum()

Athlete_Name           0
Athlete_Sex            0
Athlete_Age            0
Athlete_Height (cm)    0
Athlete_Weight (Kg)    0
Team                   0
NOC                    0
Games                  0
Year                   0
Season                 0
City                   0
Sport                  0
Event                  0
Medal                  0
Athlete_Height         0
Athlete_Weight         0
dtype: int64

In [109]:
df_l.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8048 entries, 0 to 8047
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Athlete_Name         8048 non-null   object
 1   Athlete_Sex          8048 non-null   object
 2   Athlete_Age          7781 non-null   float64
 3   Athlete_Height (cm)  6273 non-null   float64
 4   Athlete_Weight (Kg)  6184 non-null   float64
 5   Team                 8048 non-null   object
 6   NOC                  8048 non-null   object
 7   Games                8048 non-null   object
 8   Year                 8048 non-null   int64
 9   Season               8048 non-null   object
 10  City                 8048 non-null   object
 11  Sport                8048 non-null   object
 12  Event                8048 non-null   object
 13  Medal                8048 non-null   object
dtypes: float64(3), int64(1), object(10)
memory usage: 880.4+ KB

In [104]:
df_l.to_csv(r"..\Raw\athlete_events-cleaned.csv", index=False)